src/resources/API/SOAP/CountrySearchRequest.xml

<x:Envelope
    xmlns:x="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:CountrySearchRequest>
            <com:internationalPhonePrefix></com:internationalPhonePrefix>
            <com:startOfName>{countryStartingWith}</com:startOfName>
        </com:CountrySearchRequest>
    </x:Body>
</x:Envelope>