app/src/test/resources/schemas/requestcreateuser.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AccountCreateRequest xmlns="com.advantage.online.store.accountservice"><accountType>USER</accountType><address>rua teste</address><allowOffersPromotion>true</allowOffersPromotion><cityName>Rio de Janeiro</cityName><countryId>Brazil,br</countryId><email>ricardoveiga.ti@gmail.com</email><firstName>Ricardi</firstName><lastName>Veiga</lastName><loginName>ricardo1</loginName><password>Abc123</password><phoneNumber>21969416489</phoneNumber><stateProvince>RJ</stateProvince><zipcode>23075130</zipcode></AccountCreateRequest></soap:Body></soap:Envelope>