src/resources/API/SOAP/AccountLoginRequest.xml

<x:Envelope
    xmlns:x="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountLoginRequest>
            <com:loginUser>{userName}</com:loginUser>
            <com:email>{email}</com:email>
            <com:loginPassword>{password}</com:loginPassword>
        </com:AccountLoginRequest>
    </x:Body>
</x:Envelope>