src/resources/API/SOAP/AccountCreateRequest.xml

<x:Envelope
    xmlns:x="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountCreateRequest>
            <com:lastName>Ashok</com:lastName>
            <com:firstName>Kumar</com:firstName>
            <com:loginName>{userName}</com:loginName>
            <com:countryId>India,in</com:countryId>
            <com:stateProvince>Assam</com:stateProvince>
            <com:cityName>Guwahati</com:cityName>
            <com:address>Odalbakra Street, Kahilipara</com:address>
            <com:zipcode>781034</com:zipcode>
            <com:phoneNumber>{phoneNumber}</com:phoneNumber>
            <com:email>{email}</com:email>
            <com:password>{password}</com:password>
            <com:accountType>USER</com:accountType>
            <com:allowOffersPromotion>true</com:allowOffersPromotion>
            <com:aobUser>false</com:aobUser>
        </com:AccountCreateRequest>
    </x:Body>
</x:Envelope>