22/data/attachments/259ed3dbaece9883.txt

SOAP request : 
<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountLoginRequest>
            <com:loginUser>WBcmx</com:loginUser>
            <com:email>WBcmx@email.com</com:email>
            <com:loginPassword>Qcaxy298</com:loginPassword>
        </com:AccountLoginRequest>
    </x:Body>
</x:Envelope>
